grevaillot/svd_tools/headers/ATSAM4SD16B/usart1.h
#pragma once 

/* --- USART1: Universal Synchronous Asynchronous Receiver Transmitter 1  */

/** @defgroup usart1_registers Universal Synchronous Asynchronous Receiver Transmitter 1 Register
@{*/

/** USART1_CR Control Register **/
#define USART1_CR			MMIO32(USART1_BASE + 0x00)
/** USART1_CR_SPI_MODE Control Register **/
#define USART1_CR_SPI_MODE			MMIO32(USART1_BASE + 0x00)
/** USART1_MR Mode Register **/
#define USART1_MR			MMIO32(USART1_BASE + 0x04)
/** USART1_MR_SPI_MODE Mode Register **/
#define USART1_MR_SPI_MODE			MMIO32(USART1_BASE + 0x04)
/** USART1_IER Interrupt Enable Register **/
#define USART1_IER			MMIO32(USART1_BASE + 0x08)
/** USART1_IER_SPI_MODE Interrupt Enable Register **/
#define USART1_IER_SPI_MODE			MMIO32(USART1_BASE + 0x08)
/** USART1_IDR Interrupt Disable Register **/
#define USART1_IDR			MMIO32(USART1_BASE + 0x0c)
/** USART1_IDR_SPI_MODE Interrupt Disable Register **/
#define USART1_IDR_SPI_MODE			MMIO32(USART1_BASE + 0x0c)
/** USART1_IMR Interrupt Mask Register **/
#define USART1_IMR			MMIO32(USART1_BASE + 0x10)
/** USART1_IMR_SPI_MODE Interrupt Mask Register **/
#define USART1_IMR_SPI_MODE			MMIO32(USART1_BASE + 0x10)
/** USART1_CSR Channel Status Register **/
#define USART1_CSR			MMIO32(USART1_BASE + 0x14)
/** USART1_CSR_SPI_MODE Channel Status Register **/
#define USART1_CSR_SPI_MODE			MMIO32(USART1_BASE + 0x14)
/** USART1_RHR Receive Holding Register **/
#define USART1_RHR			MMIO32(USART1_BASE + 0x18)
/** USART1_THR Transmit Holding Register **/
#define USART1_THR			MMIO32(USART1_BASE + 0x1c)
/** USART1_BRGR Baud Rate Generator Register **/
#define USART1_BRGR			MMIO32(USART1_BASE + 0x20)
/** USART1_RTOR Receiver Time-out Register **/
#define USART1_RTOR			MMIO32(USART1_BASE + 0x24)
/** USART1_TTGR Transmitter Timeguard Register **/
#define USART1_TTGR			MMIO32(USART1_BASE + 0x28)
/** USART1_FIDI FI DI Ratio Register **/
#define USART1_FIDI			MMIO32(USART1_BASE + 0x40)
/** USART1_NER Number of Errors Register **/
#define USART1_NER			MMIO32(USART1_BASE + 0x44)
/** USART1_IF IrDA Filter Register **/
#define USART1_IF			MMIO32(USART1_BASE + 0x4c)
/** USART1_MAN Manchester Configuration Register **/
#define USART1_MAN			MMIO32(USART1_BASE + 0x50)
/** USART1_WPMR Write Protection Mode Register **/
#define USART1_WPMR			MMIO32(USART1_BASE + 0xe4)
/** USART1_WPSR Write Protection Status Register **/
#define USART1_WPSR			MMIO32(USART1_BASE + 0xe8)
/** USART1_RPR Receive Pointer Register **/
#define USART1_RPR			MMIO32(USART1_BASE + 0x100)
/** USART1_RCR Receive Counter Register **/
#define USART1_RCR			MMIO32(USART1_BASE + 0x104)
/** USART1_TPR Transmit Pointer Register **/
#define USART1_TPR			MMIO32(USART1_BASE + 0x108)
/** USART1_TCR Transmit Counter Register **/
#define USART1_TCR			MMIO32(USART1_BASE + 0x10c)
/** USART1_RNPR Receive Next Pointer Register **/
#define USART1_RNPR			MMIO32(USART1_BASE + 0x110)
/** USART1_RNCR Receive Next Counter Register **/
#define USART1_RNCR			MMIO32(USART1_BASE + 0x114)
/** USART1_TNPR Transmit Next Pointer Register **/
#define USART1_TNPR			MMIO32(USART1_BASE + 0x118)
/** USART1_TNCR Transmit Next Counter Register **/
#define USART1_TNCR			MMIO32(USART1_BASE + 0x11c)
/** USART1_PTCR Transfer Control Register **/
#define USART1_PTCR			MMIO32(USART1_BASE + 0x120)
/** USART1_PTSR Transfer Status Register **/
#define USART1_PTSR			MMIO32(USART1_BASE + 0x124)

/**@}*/


/** @defgroup usart1_cr CR Control Register
@{*/

/** USART1_CR_RTSDIS Request to Send Pin Control **/
#define USART1_CR_RTSDIS		(1 << 19)
/** USART1_CR_RTSEN Request to Send Pin Control **/
#define USART1_CR_RTSEN		(1 << 18)
/** USART1_CR_DTRDIS Data Terminal Ready Disable **/
#define USART1_CR_DTRDIS		(1 << 17)
/** USART1_CR_DTREN Data Terminal Ready Enable **/
#define USART1_CR_DTREN		(1 << 16)
/** USART1_CR_RETTO Start Time-out Immediately **/
#define USART1_CR_RETTO		(1 << 15)
/** USART1_CR_RSTNACK Reset Non Acknowledge **/
#define USART1_CR_RSTNACK		(1 << 14)
/** USART1_CR_RSTIT Reset Iterations **/
#define USART1_CR_RSTIT		(1 << 13)
/** USART1_CR_SENDA Send Address **/
#define USART1_CR_SENDA		(1 << 12)
/** USART1_CR_STTTO Clear TIMEOUT Flag and Start Time-out After Next Character Received **/
#define USART1_CR_STTTO		(1 << 11)
/** USART1_CR_STPBRK Stop Break **/
#define USART1_CR_STPBRK		(1 << 10)
/** USART1_CR_STTBRK Start Break **/
#define USART1_CR_STTBRK		(1 << 9)
/** USART1_CR_RSTSTA Reset Status Bits **/
#define USART1_CR_RSTSTA		(1 << 8)
/** USART1_CR_TXDIS Transmitter Disable **/
#define USART1_CR_TXDIS		(1 << 7)
/** USART1_CR_TXEN Transmitter Enable **/
#define USART1_CR_TXEN		(1 << 6)
/** USART1_CR_RXDIS Receiver Disable **/
#define USART1_CR_RXDIS		(1 << 5)
/** USART1_CR_RXEN Receiver Enable **/
#define USART1_CR_RXEN		(1 << 4)
/** USART1_CR_RSTTX Reset Transmitter **/
#define USART1_CR_RSTTX		(1 << 3)
/** USART1_CR_RSTRX Reset Receiver **/
#define USART1_CR_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart1_cr_spi_mode CRSPIMODE Control Register
@{*/

/** USART1_CR_SPI_MODE_RCS Release SPI Chip Select **/
#define USART1_CR_SPI_MODE_RCS		(1 << 19)
/** USART1_CR_SPI_MODE_FCS Force SPI Chip Select **/
#define USART1_CR_SPI_MODE_FCS		(1 << 18)
/** USART1_CR_SPI_MODE_RSTSTA Reset Status Bits **/
#define USART1_CR_SPI_MODE_RSTSTA		(1 << 8)
/** USART1_CR_SPI_MODE_TXDIS Transmitter Disable **/
#define USART1_CR_SPI_MODE_TXDIS		(1 << 7)
/** USART1_CR_SPI_MODE_TXEN Transmitter Enable **/
#define USART1_CR_SPI_MODE_TXEN		(1 << 6)
/** USART1_CR_SPI_MODE_RXDIS Receiver Disable **/
#define USART1_CR_SPI_MODE_RXDIS		(1 << 5)
/** USART1_CR_SPI_MODE_RXEN Receiver Enable **/
#define USART1_CR_SPI_MODE_RXEN		(1 << 4)
/** USART1_CR_SPI_MODE_RSTTX Reset Transmitter **/
#define USART1_CR_SPI_MODE_RSTTX		(1 << 3)
/** USART1_CR_SPI_MODE_RSTRX Reset Receiver **/
#define USART1_CR_SPI_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart1_mr MR Mode Register
@{*/

/** USART1_MR_ONEBIT Start Frame Delimiter Selector **/
#define USART1_MR_ONEBIT		(1 << 31)
/** USART1_MR_MODSYNC Manchester Synchronization Mode **/
#define USART1_MR_MODSYNC		(1 << 30)
/** USART1_MR_MAN Manchester Encoder/Decoder Enable **/
#define USART1_MR_MAN		(1 << 29)
/** USART1_MR_FILTER Receive Line Filter **/
#define USART1_MR_FILTER		(1 << 28)

