grevaillot/svd_tools/headers/ATSAM4SD16B/usart1.h
#define USART1_MR_MAX_ITERATION_SHIFT		24
#define USART1_MR_MAX_ITERATION_MASK		0x07
/** @defgroup usart1_mr_max_iteration MAXITERATION Maximum Number of Automatic Iteration
@{*/
/**@}*/

/** USART1_MR_INVDATA Inverted Data **/
#define USART1_MR_INVDATA		(1 << 23)
/** USART1_MR_VAR_SYNC Variable Synchronization of Command/Data Sync Start Frame Delimiter **/
#define USART1_MR_VAR_SYNC		(1 << 22)
/** USART1_MR_DSNACK Disable Successive NACK **/
#define USART1_MR_DSNACK		(1 << 21)
/** USART1_MR_INACK Inhibit Non Acknowledge **/
#define USART1_MR_INACK		(1 << 20)
/** USART1_MR_OVER Oversampling Mode **/
#define USART1_MR_OVER		(1 << 19)
/** USART1_MR_CLKO Clock Output Select **/
#define USART1_MR_CLKO		(1 << 18)
/** USART1_MR_MODE9 9-bit Character Length **/
#define USART1_MR_MODE9		(1 << 17)
/** USART1_MR_MSBF Bit Order **/
#define USART1_MR_MSBF		(1 << 16)

#define USART1_MR_CHMODE_SHIFT		14
#define USART1_MR_CHMODE_MASK		0x03
/** @defgroup usart1_mr_chmode CHMODE Channel Mode
@{*/
/**@}*/


#define USART1_MR_NBSTOP_SHIFT		12
#define USART1_MR_NBSTOP_MASK		0x03
/** @defgroup usart1_mr_nbstop NBSTOP Number of Stop Bits
@{*/
/**@}*/


#define USART1_MR_PAR_SHIFT		9
#define USART1_MR_PAR_MASK		0x07
/** @defgroup usart1_mr_par PAR Parity Type
@{*/
/**@}*/

/** USART1_MR_SYNC Synchronous Mode Select **/
#define USART1_MR_SYNC		(1 << 8)

#define USART1_MR_CHRL_SHIFT		6
#define USART1_MR_CHRL_MASK		0x03
/** @defgroup usart1_mr_chrl CHRL Character Length
@{*/
/**@}*/


#define USART1_MR_USCLKS_SHIFT		4
#define USART1_MR_USCLKS_MASK		0x03
/** @defgroup usart1_mr_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART1_MR_USART_MODE_SHIFT		0
#define USART1_MR_USART_MODE_MASK		0x0f
/** @defgroup usart1_mr_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_mr_spi_mode MRSPIMODE Mode Register
@{*/

/** USART1_MR_SPI_MODE_WRDBT Wait Read Data Before Transfer **/
#define USART1_MR_SPI_MODE_WRDBT		(1 << 20)
/** USART1_MR_SPI_MODE_CLKO Clock Output Select **/
#define USART1_MR_SPI_MODE_CLKO		(1 << 18)
/** USART1_MR_SPI_MODE_CPOL SPI Clock Polarity **/
#define USART1_MR_SPI_MODE_CPOL		(1 << 16)
/** USART1_MR_SPI_MODE_CPHA SPI Clock Phase **/
#define USART1_MR_SPI_MODE_CPHA		(1 << 8)

#define USART1_MR_SPI_MODE_CHRL_SHIFT		6
#define USART1_MR_SPI_MODE_CHRL_MASK		0x03
/** @defgroup usart1_mr_spi_mode_chrl CHRL Character Length
@{*/
/**@}*/


#define USART1_MR_SPI_MODE_USCLKS_SHIFT		4
#define USART1_MR_SPI_MODE_USCLKS_MASK		0x03
/** @defgroup usart1_mr_spi_mode_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART1_MR_SPI_MODE_USART_MODE_SHIFT		0
#define USART1_MR_SPI_MODE_USART_MODE_MASK		0x0f
/** @defgroup usart1_mr_spi_mode_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_ier IER Interrupt Enable Register
@{*/

/** USART1_IER_MANE Manchester Error Interrupt Enable **/
#define USART1_IER_MANE		(1 << 24)
/** USART1_IER_CTSIC Clear to Send Input Change Interrupt Enable **/
#define USART1_IER_CTSIC		(1 << 19)
/** USART1_IER_DCDIC Data Carrier Detect Input Change Interrupt Enable **/
#define USART1_IER_DCDIC		(1 << 18)
/** USART1_IER_DSRIC Data Set Ready Input Change Enable **/
#define USART1_IER_DSRIC		(1 << 17)
/** USART1_IER_RIIC Ring Indicator Input Change Enable **/
#define USART1_IER_RIIC		(1 << 16)
/** USART1_IER_NACK Non Acknowledge Interrupt Enable **/
#define USART1_IER_NACK		(1 << 13)
/** USART1_IER_RXBUFF Receive Buffer Full Interrupt Enable (available in all USART modes of operation) **/
#define USART1_IER_RXBUFF		(1 << 12)
/** USART1_IER_TXBUFE Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation) **/
#define USART1_IER_TXBUFE		(1 << 11)
/** USART1_IER_ITER Max number of Repetitions Reached Interrupt Enable **/
#define USART1_IER_ITER		(1 << 10)
/** USART1_IER_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART1_IER_TXEMPTY		(1 << 9)
/** USART1_IER_TIMEOUT Time-out Interrupt Enable **/
#define USART1_IER_TIMEOUT		(1 << 8)
/** USART1_IER_PARE Parity Error Interrupt Enable **/
#define USART1_IER_PARE		(1 << 7)
/** USART1_IER_FRAME Framing Error Interrupt Enable **/
#define USART1_IER_FRAME		(1 << 6)
/** USART1_IER_OVRE Overrun Error Interrupt Enable **/
#define USART1_IER_OVRE		(1 << 5)
/** USART1_IER_ENDTX End of Transmit Buffer Interrupt Enable (available in all USART modes of operation) **/
#define USART1_IER_ENDTX		(1 << 4)
/** USART1_IER_ENDRX End of Receive Buffer Interrupt Enable (available in all USART modes of operation) **/
#define USART1_IER_ENDRX		(1 << 3)
/** USART1_IER_RXBRK Receiver Break Interrupt Enable **/
#define USART1_IER_RXBRK		(1 << 2)
/** USART1_IER_TXRDY TXRDY Interrupt Enable **/
#define USART1_IER_TXRDY		(1 << 1)
/** USART1_IER_RXRDY RXRDY Interrupt Enable **/
#define USART1_IER_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_ier_spi_mode IERSPIMODE Interrupt Enable Register
@{*/

/** USART1_IER_SPI_MODE_RXBUFF Receive Buffer Full Interrupt Enable **/
#define USART1_IER_SPI_MODE_RXBUFF		(1 << 12)
/** USART1_IER_SPI_MODE_TXBUFE Transmit Buffer Empty Interrupt Enable **/
#define USART1_IER_SPI_MODE_TXBUFE		(1 << 11)
/** USART1_IER_SPI_MODE_UNRE SPI Underrun Error Interrupt Enable **/
#define USART1_IER_SPI_MODE_UNRE		(1 << 10)
/** USART1_IER_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART1_IER_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_IER_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART1_IER_SPI_MODE_OVRE		(1 << 5)
/** USART1_IER_SPI_MODE_ENDTX End of Transmit Buffer Interrupt Enable **/
#define USART1_IER_SPI_MODE_ENDTX		(1 << 4)
/** USART1_IER_SPI_MODE_ENDRX End of Receive Buffer Interrupt Enable **/
#define USART1_IER_SPI_MODE_ENDRX		(1 << 3)
/** USART1_IER_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART1_IER_SPI_MODE_TXRDY		(1 << 1)
/** USART1_IER_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART1_IER_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_idr IDR Interrupt Disable Register
@{*/

/** USART1_IDR_MANE Manchester Error Interrupt Disable **/
#define USART1_IDR_MANE		(1 << 24)
/** USART1_IDR_CTSIC Clear to Send Input Change Interrupt Disable **/
#define USART1_IDR_CTSIC		(1 << 19)
/** USART1_IDR_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART1_IDR_DCDIC		(1 << 18)
/** USART1_IDR_DSRIC Data Set Ready Input Change Disable **/
#define USART1_IDR_DSRIC		(1 << 17)
/** USART1_IDR_RIIC Ring Indicator Input Change Disable **/
#define USART1_IDR_RIIC		(1 << 16)
/** USART1_IDR_NACK Non Acknowledge Interrupt Disable **/
#define USART1_IDR_NACK		(1 << 13)
/** USART1_IDR_RXBUFF Receive Buffer Full Interrupt Disable (available in all USART modes of operation) **/
#define USART1_IDR_RXBUFF		(1 << 12)
/** USART1_IDR_TXBUFE Transmit Buffer Empty Interrupt Disable (available in all USART modes of operation) **/
#define USART1_IDR_TXBUFE		(1 << 11)
/** USART1_IDR_ITER Max Number of Repetitions Reached Interrupt Disable **/
#define USART1_IDR_ITER		(1 << 10)
/** USART1_IDR_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_IDR_TXEMPTY		(1 << 9)
/** USART1_IDR_TIMEOUT Time-out Interrupt Disable **/
#define USART1_IDR_TIMEOUT		(1 << 8)
/** USART1_IDR_PARE Parity Error Interrupt Disable **/
#define USART1_IDR_PARE		(1 << 7)
/** USART1_IDR_FRAME Framing Error Interrupt Disable **/
#define USART1_IDR_FRAME		(1 << 6)
/** USART1_IDR_OVRE Overrun Error Interrupt Enable **/
#define USART1_IDR_OVRE		(1 << 5)
/** USART1_IDR_ENDTX End of Transmit Buffer Interrupt Disable (available in all USART modes of operation) **/
#define USART1_IDR_ENDTX		(1 << 4)
/** USART1_IDR_ENDRX End of Receive Buffer Transfer Interrupt Disable (available in all USART modes of operation) **/
#define USART1_IDR_ENDRX		(1 << 3)
/** USART1_IDR_RXBRK Receiver Break Interrupt Disable **/
#define USART1_IDR_RXBRK		(1 << 2)
/** USART1_IDR_TXRDY TXRDY Interrupt Disable **/
#define USART1_IDR_TXRDY		(1 << 1)
/** USART1_IDR_RXRDY RXRDY Interrupt Disable **/
#define USART1_IDR_RXRDY		(1 << 0)

/**@}*/

