grevaillot/svd_tools/headers/ATSAM4SD16B/usart1.h
/** @defgroup usart1_idr_spi_mode IDRSPIMODE Interrupt Disable Register
@{*/

/** USART1_IDR_SPI_MODE_RXBUFF Receive Buffer Full Interrupt Disable **/
#define USART1_IDR_SPI_MODE_RXBUFF		(1 << 12)
/** USART1_IDR_SPI_MODE_TXBUFE Transmit Buffer Empty Interrupt Disable **/
#define USART1_IDR_SPI_MODE_TXBUFE		(1 << 11)
/** USART1_IDR_SPI_MODE_UNRE SPI Underrun Error Interrupt Disable **/
#define USART1_IDR_SPI_MODE_UNRE		(1 << 10)
/** USART1_IDR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_IDR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_IDR_SPI_MODE_OVRE Overrun Error Interrupt Disable **/
#define USART1_IDR_SPI_MODE_OVRE		(1 << 5)
/** USART1_IDR_SPI_MODE_ENDTX End of Transmit Buffer Interrupt Disable **/
#define USART1_IDR_SPI_MODE_ENDTX		(1 << 4)
/** USART1_IDR_SPI_MODE_ENDRX End of Receive Buffer Transfer Interrupt Disable **/
#define USART1_IDR_SPI_MODE_ENDRX		(1 << 3)
/** USART1_IDR_SPI_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART1_IDR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_IDR_SPI_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART1_IDR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_imr IMR Interrupt Mask Register
@{*/

/** USART1_IMR_MANE Manchester Error Interrupt Mask **/
#define USART1_IMR_MANE		(1 << 24)
/** USART1_IMR_CTSIC Clear to Send Input Change Interrupt Mask **/
#define USART1_IMR_CTSIC		(1 << 19)
/** USART1_IMR_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART1_IMR_DCDIC		(1 << 18)
/** USART1_IMR_DSRIC Data Set Ready Input Change Mask **/
#define USART1_IMR_DSRIC		(1 << 17)
/** USART1_IMR_RIIC Ring Indicator Input Change Mask **/
#define USART1_IMR_RIIC		(1 << 16)
/** USART1_IMR_NACK Non Acknowledge Interrupt Mask **/
#define USART1_IMR_NACK		(1 << 13)
/** USART1_IMR_RXBUFF Receive Buffer Full Interrupt Mask (available in all USART modes of operation) **/
#define USART1_IMR_RXBUFF		(1 << 12)
/** USART1_IMR_TXBUFE Transmit Buffer Empty Interrupt Mask (available in all USART modes of operation) **/
#define USART1_IMR_TXBUFE		(1 << 11)
/** USART1_IMR_ITER Max Number of Repetitions Reached Interrupt Mask **/
#define USART1_IMR_ITER		(1 << 10)
/** USART1_IMR_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART1_IMR_TXEMPTY		(1 << 9)
/** USART1_IMR_TIMEOUT Time-out Interrupt Mask **/
#define USART1_IMR_TIMEOUT		(1 << 8)
/** USART1_IMR_PARE Parity Error Interrupt Mask **/
#define USART1_IMR_PARE		(1 << 7)
/** USART1_IMR_FRAME Framing Error Interrupt Mask **/
#define USART1_IMR_FRAME		(1 << 6)
/** USART1_IMR_OVRE Overrun Error Interrupt Mask **/
#define USART1_IMR_OVRE		(1 << 5)
/** USART1_IMR_ENDTX End of Transmit Buffer Interrupt Mask (available in all USART modes of operation) **/
#define USART1_IMR_ENDTX		(1 << 4)
/** USART1_IMR_ENDRX End of Receive Buffer Interrupt Mask (available in all USART modes of operation) **/
#define USART1_IMR_ENDRX		(1 << 3)
/** USART1_IMR_RXBRK Receiver Break Interrupt Mask **/
#define USART1_IMR_RXBRK		(1 << 2)
/** USART1_IMR_TXRDY TXRDY Interrupt Mask **/
#define USART1_IMR_TXRDY		(1 << 1)
/** USART1_IMR_RXRDY RXRDY Interrupt Mask **/
#define USART1_IMR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_imr_spi_mode IMRSPIMODE Interrupt Mask Register
@{*/

/** USART1_IMR_SPI_MODE_RXBUFF Receive Buffer Full Interrupt Mask **/
#define USART1_IMR_SPI_MODE_RXBUFF		(1 << 12)
/** USART1_IMR_SPI_MODE_TXBUFE Transmit Buffer Empty Interrupt Mask **/
#define USART1_IMR_SPI_MODE_TXBUFE		(1 << 11)
/** USART1_IMR_SPI_MODE_UNRE SPI Underrun Error Interrupt Mask **/
#define USART1_IMR_SPI_MODE_UNRE		(1 << 10)
/** USART1_IMR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART1_IMR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_IMR_SPI_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART1_IMR_SPI_MODE_OVRE		(1 << 5)
/** USART1_IMR_SPI_MODE_ENDTX End of Transmit Buffer Interrupt Mask **/
#define USART1_IMR_SPI_MODE_ENDTX		(1 << 4)
/** USART1_IMR_SPI_MODE_ENDRX End of Receive Buffer Interrupt Mask **/
#define USART1_IMR_SPI_MODE_ENDRX		(1 << 3)
/** USART1_IMR_SPI_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART1_IMR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_IMR_SPI_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART1_IMR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_csr CSR Channel Status Register
@{*/

/** USART1_CSR_MANERR Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) **/
#define USART1_CSR_MANERR		(1 << 24)
/** USART1_CSR_CTS Image of CTS Input **/
#define USART1_CSR_CTS		(1 << 23)
/** USART1_CSR_DCD Image of DCD Input **/
#define USART1_CSR_DCD		(1 << 22)
/** USART1_CSR_DSR Image of DSR Input **/
#define USART1_CSR_DSR		(1 << 21)
/** USART1_CSR_RI Image of RI Input **/
#define USART1_CSR_RI		(1 << 20)
/** USART1_CSR_CTSIC Clear to Send Input Change Flag (cleared on read) **/
#define USART1_CSR_CTSIC		(1 << 19)
/** USART1_CSR_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART1_CSR_DCDIC		(1 << 18)
/** USART1_CSR_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART1_CSR_DSRIC		(1 << 17)
/** USART1_CSR_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART1_CSR_RIIC		(1 << 16)
/** USART1_CSR_NACK Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) **/
#define USART1_CSR_NACK		(1 << 13)
/** USART1_CSR_RXBUFF RX Buffer Full (cleared by writing US_RCR or US_RNCR) **/
#define USART1_CSR_RXBUFF		(1 << 12)
/** USART1_CSR_TXBUFE TX Buffer Empty (cleared by writing US_TCR or US_TNCR) **/
#define USART1_CSR_TXBUFE		(1 << 11)
/** USART1_CSR_ITER Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) **/
#define USART1_CSR_ITER		(1 << 10)
/** USART1_CSR_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART1_CSR_TXEMPTY		(1 << 9)
/** USART1_CSR_TIMEOUT Receiver Time-out (cleared by writing a one to bit US_CR.STTTO) **/
#define USART1_CSR_TIMEOUT		(1 << 8)
/** USART1_CSR_PARE Parity Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_CSR_PARE		(1 << 7)
/** USART1_CSR_FRAME Framing Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_CSR_FRAME		(1 << 6)
/** USART1_CSR_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_CSR_OVRE		(1 << 5)
/** USART1_CSR_ENDTX End of TX Buffer (cleared by writing US_TCR or US_TNCR) **/
#define USART1_CSR_ENDTX		(1 << 4)
/** USART1_CSR_ENDRX End of RX Buffer (cleared by writing US_RCR or US_RNCR) **/
#define USART1_CSR_ENDRX		(1 << 3)
/** USART1_CSR_RXBRK Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_CSR_RXBRK		(1 << 2)
/** USART1_CSR_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART1_CSR_TXRDY		(1 << 1)
/** USART1_CSR_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART1_CSR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_csr_spi_mode CSRSPIMODE Channel Status Register
@{*/

/** USART1_CSR_SPI_MODE_RXBUFF RX Buffer Full (cleared by writing US_RCR or US_RNCR) **/
#define USART1_CSR_SPI_MODE_RXBUFF		(1 << 12)
/** USART1_CSR_SPI_MODE_TXBUFE TX Buffer Empty (cleared by writing US_TCR or US_TNCR) **/
#define USART1_CSR_SPI_MODE_TXBUFE		(1 << 11)
/** USART1_CSR_SPI_MODE_UNRE Underrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_CSR_SPI_MODE_UNRE		(1 << 10)
/** USART1_CSR_SPI_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART1_CSR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_CSR_SPI_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART1_CSR_SPI_MODE_OVRE		(1 << 5)
/** USART1_CSR_SPI_MODE_ENDTX End of TX Buffer (cleared by writing US_TCR or US_TNCR) **/
#define USART1_CSR_SPI_MODE_ENDTX		(1 << 4)
/** USART1_CSR_SPI_MODE_ENDRX End of RX Buffer (cleared by writing US_RCR or US_RNCR) **/
#define USART1_CSR_SPI_MODE_ENDRX		(1 << 3)
/** USART1_CSR_SPI_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART1_CSR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_CSR_SPI_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART1_CSR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_rhr RHR Receive Holding Register
@{*/

/** USART1_RHR_RXSYNH Received Sync **/
#define USART1_RHR_RXSYNH		(1 << 15)

#define USART1_RHR_RXCHR_SHIFT		0
#define USART1_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart1_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_thr THR Transmit Holding Register
@{*/

/** USART1_THR_TXSYNH Sync Field to be Transmitted **/
#define USART1_THR_TXSYNH		(1 << 15)

#define USART1_THR_TXCHR_SHIFT		0
#define USART1_THR_TXCHR_MASK		0x1ff
/** @defgroup usart1_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_brgr BRGR Baud Rate Generator Register
@{*/


#define USART1_BRGR_FP_SHIFT		16
#define USART1_BRGR_FP_MASK		0x07
/** @defgroup usart1_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART1_BRGR_CD_SHIFT		0
#define USART1_BRGR_CD_MASK		0xffff
/** @defgroup usart1_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_rtor RTOR Receiver Time-out Register
@{*/


#define USART1_RTOR_TO_SHIFT		0
#define USART1_RTOR_TO_MASK		0xffff
/** @defgroup usart1_rtor_to TO Time-out Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_ttgr TTGR Transmitter Timeguard Register
@{*/


